surfaceWater/runCases/SplineSmallDomain_LES/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    back
    {
        type            empty;
        nFaces          9700;
        startFace       19203;
    }
    bottom
    {
        type            wall;
        physicalType    wall;
        nFaces          100;
        startFace       28903;
    }
    right
    {
        type            cyclicAMI;
        neighbourPatch  left;
        transform       translational;
        separationVector    (-0.15 0 0);
        nFaces          97;
        startFace       29003;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          100;
        startFace       29100;
    }
    left
    {
        type            cyclicAMI;
        neighbourPatch  right;
        transform       translational;
        separationVector    (0.15 0 0);
        nFaces          97;
        startFace       29200;
    }
    front
    {
        type            empty;
        nFaces          9700;
        startFace       29297;
    }
)

// ************************************************************************* //
